Autodesk.Revit.DB.AttachmentLocation
Represents the attachment location of the element.
Since:
2025.2
Since:
2025.2

Autodesk.Revit.DB.AttachmentLocation.Top
The attachment is made at the top of the element.

Autodesk.Revit.DB.AttachmentLocation.Base
The attachment is made at the base of the element.